src/Catalogs/Локации/Локации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Локации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Кампании</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Псевдонимы</name>
    <attributes>
      <name>Псевдоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Локации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик проверки заполнения элемента справочника Локации.
//
// Выполняемые проверки:
//  - заполненность реквизитов Владелец (Кампания) и Наименование;
//  - совпадение Кампании родительской локации с Кампанией текущей;
//  - отсутствие циклической иерархии;
//  - согласованность Кампании при смене Владельца у существующей локации
//    (потомки не должны оставаться связанными с другой Кампанией);
//  - обязательность заполнения псевдонимов;
//  - уникальность псевдонимов в пределах локации без учета регистра;
//  - совпадение псевдонима с Наименованием локации.
//
// Параметры:
//  Отказ               - Булево - признак отказа от записи.
//  ПроверяемыеРеквизиты - Массив - массив путей к реквизитам, подлежащим проверке.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Ошибки = Неопределено;
	ПроверяемыеРеквизитыОбъекта = Новый Массив;

	ПроверитьЗаполнениеКампании(Ошибки);
	ПроверитьЗаполнениеНаименования(Ошибки);
	ПроверитьСовпадениеКампанииРодителя(Ошибки);
	ПроверитьОтсутствиеЦиклическойИерархии(Ошибки);
	ПроверитьСменуКампании(Ошибки);
	ПроверитьПсевдонимы(Ошибки, ПроверяемыеРеквизитыОбъекта);

	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПроверяемыеРеквизитыОбъекта);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеКампании(Ошибки)

	Если ЗначениеЗаполнено(Владелец) Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
		"Объект.Владелец",
		НСтр("ru = 'Кампания не выбрана.'"),
		"");

КонецПроцедуры

Процедура ПроверитьЗаполнениеНаименования(Ошибки)

	Если ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
		"Объект.Наименование",
		НСтр("ru = 'Наименование не заполнено.'"),
		"");

КонецПроцедуры

Процедура ПроверитьСовпадениеКампанииРодителя(Ошибки)

	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		Возврат;
	КонецЕсли;

	ВладелецРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Владелец");
	Если ВладелецРодителя = Владелец Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
		"Объект.Родитель",
		НСтр("ru = 'Кампания родительской локации должна совпадать с кампанией текущей локации.'"),
		"");

КонецПроцедуры

Процедура ПроверитьОтсутствиеЦиклическойИерархии(Ошибки)

	Если НЕ ЗначениеЗаполнено(Родитель)
		ИЛИ НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;

	ТекущийПредок = Родитель;
	Пока ЗначениеЗаполнено(ТекущийПредок) Цикл
		Если ТекущийПредок = Ссылка Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Родитель",
				НСтр("ru = 'Обнаружена циклическая иерархия: родительская локация не может быть потомком текущей.'"),
				"");
			Прервать;
		КонецЕсли;
		ТекущийПредок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПредок, "Родитель");
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьСменуКампании(Ошибки)

	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	СтарыйВладелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец");
	Если СтарыйВладелец = Владелец Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяЛокация", Ссылка);
	Запрос.УстановитьПараметр("НоваяКампания", Владелец);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Ссылка В ИЕРАРХИИ(&ТекущаяЛокация)
	|	И Локации.Ссылка <> &ТекущаяЛокация
	|	И Локации.Владелец <> &НоваяКампания";

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
		"Объект.Владелец",
		НСтр("ru = 'Невозможно изменить кампанию: у локации есть потомки, связанные с другой кампанией.'"),
		"");

КонецПроцедуры

Процедура ПроверитьПсевдонимы(Ошибки, ПроверяемыеРеквизитыОбъекта)

	ПроверяемыеРеквизитыОбъекта.Добавить("Псевдонимы.Псевдоним");

	ИспользованныеПсевдонимы = Новый Соответствие;
	НаименованиеВРег = ВРег(СокрЛП(Наименование));

	Для каждого СтрокаПсевдонима Из Псевдонимы Цикл
		НомерСтроки = Псевдонимы.Индекс(СтрокаПсевдонима);
		Псевдоним = СокрЛП(СтрокаПсевдонима.Псевдоним);

		Если НЕ ЗначениеЗаполнено(Псевдоним) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Псевдонимы[%1].Псевдоним",
				НСтр("ru = 'Псевдоним не заполнен.'"),
				"Объект.Псевдонимы",
				НомерСтроки,
				НСтр("ru = 'Псевдоним в строке %1 не заполнен.'"));
			Продолжить;
		КонецЕсли;

		ПсевдонимВРег = ВРег(Псевдоним);

		Если ПсевдонимВРег = НаименованиеВРег Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Псевдонимы[%1].Псевдоним",
				НСтр("ru = 'Псевдоним совпадает с наименованием локации.'"),
				"Объект.Псевдонимы",
				НомерСтроки,
				НСтр("ru = 'Псевдоним в строке %1 совпадает с наименованием локации.'"));
			Продолжить;
		КонецЕсли;

		Если ИспользованныеПсевдонимы[ПсевдонимВРег] <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Псевдонимы[%1].Псевдоним",
				НСтр("ru = 'Псевдоним повторяется в пределах локации.'"),
				"Объект.Псевдонимы",
				НомерСтроки,
				НСтр("ru = 'Псевдоним в строке %1 повторяется.'"));
			Продолжить;
		КонецЕсли;

		ИспользованныеПсевдонимы.Вставить(ПсевдонимВРег, Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
